# PlanViewViewDir Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlanViewViewDir Property
ParameterTypeId Class See Also
---
"View Direction"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlanViewViewDir { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlanViewViewDir As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlanViewViewDir {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace